I am specifying view and zone IDs as reference to other resources like this:

```hcl
resource "oci_dns_zone" "the_zone" {
  #Required
  compartment_id = var.compartment_id
  name           = "example.com"
  zone_type      = "PRIMARY"

  scope          = "PRIVATE"
  view_id        = oci_dns_view.the_view.id
}

resource "oci_dns_view" "the_view" {
  #Required
  compartment_id = var.compartment_id
  scope          = "PRIVATE"
}

resource "oci_dns_rrset" "the_rrset" {
  #Required
  domain          = "my.example.com"
  rtype           = "SRV"
  zone_name_or_id = oci_dns_zone.the_zone.id

  #Optional
  compartment_id = var.compartment_id
  items {
     #Required
     domain = "my.example.com"
     rdata  = "0 100 389 example.com."
     rtype  = "SRV"
     ttl    = 300
  }
  scope   = "PRIVATE"
  view_id = oci_dns_view.the_view.id
}
```

```hcl
terraform plan

# oci_dns_rrset.the_rrset will be updated in-place
  ~ resource "oci_dns_rrset" "the_rrset" {
        id              = "zoneNameOrId/ocid1.dns-zone.oc1.iad.aaaaxofwl6acaaaih6gdhdceosroceqlro4tjasxqp34pncymi7tuyxhsdaq/domain/my.example.com/rtype/SRV"
        # (6 unchanged attributes hidden)

      + items {
          + domain        = "my.example.com"
          + is_protected  = (known after apply)
          + rdata         = "0 100 389 example.com."
          + record_hash   = (known after apply)
          + rrset_version = (known after apply)
          + rtype         = "SRV"
          + ttl           = 300
        }
      - items {
          - domain        = "my.example.com" -> null
          - is_protected  = false -> null
          - rdata         = "0 100 389 example.com." -> null
          - record_hash   = "d1d083776d0caabf956c46cf81c12ea1" -> null
          - rrset_version = "13" -> null
          - rtype         = "SRV" -> null
          - ttl           = 300 -> null
        }
    }
```
